# Chapter I - Data Manipulation with Pandas
## Part II - Basic Exploratory Data Analysis

In [1]:
import pandas as pd

# Import dataset
df = pd.read_csv('Group4_Assignment2_C1_Part1.csv')

### Question 2

In [2]:
# Compute the total Meat and Fish by ID
df['MntProteinProducts'] = df['MntMeatProducts'] + df['MntFishProducts']

# Amount in proteins for ID = 4141
df.loc[df['ID'] == 4141,['ID','MntProteinProducts']]

        ID  MntProteinProducts
1385  4141                 238

### Question 3

In [3]:
# Filter by 'BabyBoomer', keep only columns 'Marital_Status' & 'MntProteinProducts', then groupby with sum()
df.loc[df['Generation'] == 'BabyBoomer', ['Marital_Status','MntProteinProducts']].groupby('Marital_Status').sum()

                MntProteinProducts
Marital_Status
Absurd                         699
Alone                           47
Divorced                     17863
Married                      58142
Single                       32533
Together                     44991
Widow                        13518

### Question 4

In [4]:
# Keep columns ['Generation','Kidhome','MntSweetProducts'], then group by 'Generation' and 'Kidhome' with mean()
df[['Generation','Kidhome','MntSweetProducts']].groupby(by=['Generation','Kidhome']).mean().round(2)

# The average amount spent on sweets for Millenials with 2 kids is = 9.25

                    MntSweetProducts
Generation Kidhome
BabyBoomer 0                   35.88
           1                    5.68
           2                    1.85
GenX       0                   43.31
           1                    9.07
           2                    4.07
Millenial  0                   49.06
           1                    9.94
           2                    9.25
Silent     0                   32.50

### Question 5

In [5]:
# Get the Maximum income in the column Income
maxIncome = df.Income.max()

# Calculate the bins starting from 0 up to the 'maxIncome' included, in steps of 10000
bins = [x for x in range(0, int(maxIncome+10000), 10000)]

# Using the pd.cut() method we groupby the bins of the Incomes, then calculate the means for the selected columns 'MntGoldProds', 'MntWines', 'NumDealsPurchases'
df[['MntGoldProds', 'MntWines', 'NumDealsPurchases']].groupby(pd.cut(df.Income, bins=bins)).mean().round(2)

# Average amount spent on wine for those with an income 90-100k = 856.35

                  MntGoldProds  MntWines  NumDealsPurchases
Income
(0, 10000]               44.17     16.41               3.83
(10000, 20000]           13.05      7.59               2.20
(20000, 30000]           15.34     15.96               1.84
(30000, 40000]           18.12     46.46               2.19
(40000, 50000]           30.64    151.89               2.88
(50000, 60000]           49.45    333.20               3.38
(60000, 70000]           65.45    523.30               2.60
(70000, 80000]           75.92    606.56               1.61
(80000, 90000]           73.10    682.70               1.11
(90000, 100000]          59.18    856.35               0.62
(100000, 110000]        145.25    665.50               0.25